BOQ/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BOQ/src/Catalogs/ГруппыПользователей/Forms/Элемент/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () И Объект.Родитель.Ссылка = Справочники.ГруппыПользователей.ВсеПользователи ) Тогда
		Объект.Родитель = Справочники.ГруппыПользователей.ПустаяСсылка ();
	КонецЕсли;
	Если Объект.Ссылка = Справочники.ГруппыПользователей.ВсеПользователи Тогда
		Элементы.Наименование.Доступность = Ложь;
		Элементы.Родитель.Доступность = Ложь;
		Элементы.СоставПодобрать.Доступность = Ложь;
		Элементы.Состав.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи ( ПараметрыЗаписи )
	
	Оповестить ( "ЗаписьГруппыПользователей", Новый Структура, Объект.Ссылка );
	
КонецПроцедуры

&НаКлиенте
Процедура РодительНачалоВыбора ( Элемент, ДанныеВыбора, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	п = Новый Структура ();
	п.Вставить ( "РежимВыбора", Истина );
	п.Вставить ( "ВыборРодителя" );
	ОткрытьФорму ( "Справочник.ГруппыПользователей.Форма.Выбор", п, Элементы.Родитель );
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОбработкаВыбора ( Элемент, ВыбранноеЗначение, СтандартнаяОбработка )
	
	Если ТипЗнч ( ВыбранноеЗначение ) = Тип ( "Массив" ) Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			обработкаВыбораПользователя ( Значение );
		КонецЦикла;
	Иначе
		обработкаВыбораПользователя ( ВыбранноеЗначение );
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПользователей ( Команда )
	
	п = Новый Структура;
	п.Вставить ( "РежимВыбора", Истина );
	п.Вставить ( "ЗакрыватьПриВыборе", Ложь );
	ОткрытьФорму ( "Справочник.Пользователи.Форма.Выбор", п, Элементы.Состав );

КонецПроцедуры

&НаКлиенте
Процедура обработкаВыбораПользователя ( ВыбранноеЗначение )
	
	Если ТипЗнч ( ВыбранноеЗначение ) = Тип ( "СправочникСсылка.Пользователи" ) Тогда
		Если Объект.Состав.НайтиСтроки ( Новый Структура ( "Пользователь", ВыбранноеЗначение ) ).Количество () = 0 Тогда
			Объект.Состав.Добавить ().Пользователь = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
